xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_smartcard.c
/******************************************************************************
 * @file     nano1xx_smartcard.c
 * @brief    NANO1xx Smartcard driver source file
 * @version  1.0.2
 * @date     02, October, 2012
 *
 * @note
 * Copyright (C) 2012-2014 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "nano1xx_sys.h"
#include "nano1xx_smartcard.h"
#include "nano1xx_assert.h"
#include "nano1xx_gpio.h"


/** @addtogroup NANO1xx_Device_Driver NANO1xx Device Driver
  @{
*/

/** @addtogroup NANO1xx_SMARTCARD_Driver SMARTCARD Driver
  @{
*/


/** @addtogroup NANO1xx_SMARTCARD_EXPORTED_VARIABLES SMARTCARD Exported Variables
  @{
*/
/* global buffer is used for IST to receive */
uint8_t g_Port0_RxBUF[MIN_BUFFER_SIZE];
uint8_t g_Port1_RxBUF[MIN_BUFFER_SIZE];
uint8_t g_Port2_RxBUF[MIN_BUFFER_SIZE];

/* global buffer is used for IST to transmit */
uint8_t g_Port0_TxBUF[MIN_BUFFER_SIZE];
uint8_t g_Port1_TxBUF[MIN_BUFFER_SIZE];
uint8_t g_Port2_TxBUF[MIN_BUFFER_SIZE];

/* global variable for SmartCard Device */
S_SC_DEV_T sc_device[SMARTCARD_NUM];

/* global variables for receiving ATR from smartcard */
/*volatile*/ uint32_t atr_len0=0, atr_remain0=2/* TS & T0 */;
/*volatile*/ int32_t ifbyte_flag0=-1/* interface bytes flag */, tck0=0, ifcount0=0;

/*volatile*/ uint32_t atr_len1=0, atr_remain1=2/* TS & T0 */;
/*volatile*/ int32_t ifbyte_flag1=-1/* interface bytes flag */, tck1=0, ifcount1=0;

/*volatile*/ uint32_t atr_len2=0, atr_remain2=2/* TS & T0 */;
/*volatile*/ int32_t ifbyte_flag2=-1/* interface bytes flag */, tck2=0, ifcount2=0;

/* ATR is returned within ATR_TOTAL_TIME ETUs defined by EMV */
/*volatile*/ int32_t atr_time0=ATR_TOTAL_TIME, atr_time1=ATR_TOTAL_TIME, atr_time2=ATR_TOTAL_TIME;
/*volatile*/ int32_t atr_check_time0=0,atr_check_time1=0,atr_check_time2=0;
/*volatile*/ int32_t atr_total_time_start_flag0 = 0;
/*volatile*/ int32_t atr_total_time_start_flag1 = 0;
/*volatile*/ int32_t atr_total_time_start_flag2 = 0;

/* ATR: spend one waiting to check if other redundant byte */
/*volatile*/ int32_t atr_final_chk0=0, atr_final_chk1=0, atr_final_chk2=0;


/* To store the expected data from ICC, driver will keep it for next reading request */
/*volatile*/ uint8_t g_SC0UnexpectedInBuf[MIN_BUFFER_SIZE], g_SC1UnexpectedInBuf[MIN_BUFFER_SIZE], g_SC2UnexpectedInBuf[MIN_BUFFER_SIZE];
/*volatile*/ uint8_t g_SC0UnexpectedBufLen = 0, g_SC1UnexpectedBufLen = 0, g_SC2UnexpectedBufLen = 0;


/* re-fill ETU divider */
/*volatile*/ uint32_t g_SC0ETUDivider = 372;
/*volatile*/ uint32_t g_SC1ETUDivider = 372;
/*volatile*/ uint32_t g_SC2ETUDivider = 372;

/*@}*/ /* end of group NANO1xx_SMARTCARD_EXPORTED_VARIABLES */


/** @addtogroup NANO1xx_SMARTCARD_EXPORTED_FUNCTIONS SMARTCARD Exported Functions
  @{
*/


/**
  * @brief   Retuen string describe error number
  * @param   errno Error number
  * @return  Error string
  */
uint8_t * SMARTCARD_ERRMSG(long errno)
{
        if(errno == SC_ERR_CARD_REMOVED)
                return "SC_ERR_CARD_REMOVED";
        if(errno == SC_ERR_OVER_RUN)
                return "SC_ERR_OVER_RUN";
        if(errno == SC_ERR_PARITY_ERROR)
                return "SC_ERR_PARITY_ERROR";
        if(errno == SC_ERR_NO_STOP)
                return "SC_ERR_NO_STOP";
        if(errno == SC_ERR_SILENT_BYTE)
                return "SC_ERR_SILENT_BYTE";
        if(errno == SC_ERR_CMD)
                return "SC_ERR_CMD";
        if(errno == SC_ERR_UNSUPPORTEDCARD)
                return "SC_ERR_UNSUPPORTEDCARD";
        if(errno == SC_ERR_READ)
                return "SC_ERR_READ";
        if(errno == SC_ERR_WRITE)
                return "SC_ERR_WRITE";
        if(errno == SC_ERR_TIME0OUT)
                return "SC_ERR_TIME0OUT";
        if(errno == SC_ERR_TIME1OUT)
                return "SC_ERR_TIME1OUT";
        if(errno == SC_ERR_TIME2OUT)
                return "SC_ERR_TIME2OUT";
        if(errno == PROTOCOL_T0_ERROR)
                return "PROTOCOL_T0_ERROR";
        if(errno == SC_ERR_AUTOCONVENTION)
                return "SC_ERR_AUTOCONVENTION";
        if(errno == SC_ERR_BGTIMEOUT)
                return "SC_ERR_BGTIMEOUT";
        if(errno == SC_EPROTOCOL)
                return "SC_EPROTOCOL";
        if(errno == T1_ERROR_CHKSUM)
                return "T1_ERROR_CHKSUM";
        if(errno == PROTOCOL_T1_ERROR)
                return "PROTOCOL_T1_ERROR";
        if(errno == ATR_ERR_INVALID_PARAMETER)
                return "ATR_ERR_INVALID_PARAMETER";

        return "No Such Error Messages";
}

/**
  * @brief  Check if SmartCard slot is presented
  * @param  portno Indicate which port to be used (SC0, SC1, SC2)
  * @return Card present or not
  * @retval SCARD_PRESENT SmartCard is presented
  * @retval SCARD_ABSENT  SmartCard is absent
  */
int32_t SMARTCARD_CheckCardPresent(SC_TypeDef *portno)
{
        S_SC_DEV_T *dev;
        int32_t port = 0;

        if(portno==SC0)
                port = 0;
        else if(portno==SC1)
                port = 1;
        else if(portno==SC2)
                port = 2;

        dev= (S_SC_DEV_T *)(uint32_t)&sc_device[port];

        return dev->bCardRemoved;
}

/**
  * @brief  Driver always returns card is present. This function generally is called when
  *         no card detection pin in HW environment
  * @param  portno Indicate which port to be used (SC0, SC1, SC2)
  * @return None
  */
void SMARTCARD_IgnoreCardAbsent(SC_TypeDef *portno)
{
        S_SC_DEV_T *dev;
        int32_t port = 0;


        if(portno==SC0)
                port = 0;
        else if(portno==SC1)
                port = 1;
        else if(portno==SC2)
                port = 2;

        dev= (S_SC_DEV_T *)(uint32_t)&sc_device[port];

        dev->bCardRemoved = SCARD_PRESENT;

