xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_smartcard.c
}


/**
  * @brief  Enable/Disable smartcard clock
  * @param  dev  Pointer of data structure of smartcard information
  * @param  onoff   1:Enable clock; 0:Disable clock
  * @return None
  */
void SMARTCARD_SetClockState(S_SC_DEV_T *dev, int8_t onoff)
{
        SC_TypeDef *SC = dev->base;

        assert_param((onoff==0) || (onoff==1));

        if ( onoff == 1 )
                SC->PINCSR |= SC_PINCSR_CLK_KEEP;
        else
                SC->PINCSR &= ~SC_PINCSR_CLK_KEEP;
}

/**
  * @brief  Set the clock stop level according the clock_stop_level field of structure.
  * @param  dev  Pointer of data structure of smartcard information
  * @return None
  */
static void SMARTCARD_ClockStopLevel(S_SC_DEV_T *dev)
{
        SC_TypeDef *SC = dev->base;
        E_CLOCK_STOP clock_level = dev->clock_stop_level;

        if ( clock_level == CLOCKSTOP_LOW )
                SC->PINCSR &= ~SC_PINCSR_CLK_STOP_LEV;
        else if ( clock_level == CLOCKSTOP_HIGH )
                SC->PINCSR |= SC_PINCSR_CLK_STOP_LEV;
}

/**
  * @brief  Enable Tx error retry function and set the number of times of Tx error retry.
  *         Tx Error retry means that transmission has parity error, hardware will re-transmit again.
  * @param  dev    The pointer of data structure of smartcard information
  * @param  errNum The number of times of Tx error retry. The range of value is from 0 to 8.
  * @return None
  */
static void SMARTCARD_SetTxRetry(S_SC_DEV_T *dev, uint32_t errNum)
{
        SC_TypeDef *SC = dev->base;

        assert_param( errNum<9 );

        if(errNum == 0) {       // disable Tx error retry
                SC->CTL &= ~(SC_CTL_TX_ERETRY_MASK | SC_CTL_TX_ERETRY_EN);
        } else {
                SC->CTL = (SC->CTL & ~SC_CTL_TX_ERETRY_MASK) | ((errNum - 1) << 20) | SC_CTL_TX_ERETRY_EN;
        }

}

/**
  * @brief  Enable Rx error retry function and set the number of times of Rx error retry.
  *         Rx Error retry means that receiver detects a parity error, hardware will pull I/O LOW to notice the transmitter
  * @param  dev    The pointer of data structure of smartcard information
  * @param  errNum The number of times of Rx error retry. The range of value is from 0 to 8.
  * @return None
  */
static void SMARTCARD_SetRxRetry(S_SC_DEV_T *dev, uint32_t errNum)
{
        SC_TypeDef *SC = dev->base;

        assert_param( errNum<9 );

        if(errNum == 0) {       // disable Rx error retry
                SC->CTL &= ~(SC_CTL_RX_ERETRY_MASK | SC_CTL_RX_ERETRY_EN);
        } else {
          SC->CTL = (SC->CTL & ~SC_CTL_RX_ERETRY_MASK) | ((errNum - 1) << 16) | SC_CTL_RX_ERETRY_EN;
        }
}

/**
  * @brief  Reset the Tx/Rx FIFO
  * @param  dev  Pointer of data structure of smartcard information
  * @return None
  */
void SMARTCARD_ClearFIFO(S_SC_DEV_T *dev)
{
        SC_TypeDef *SC = dev->base;

        /* Check if the end of initial end sequence */
        while(SC->ALTCTL & SC_ALTCTL_WARST_EN) ;
        while(SC->ALTCTL & SC_ALTCTL_ACT_EN) ;
        while(SC->ALTCTL & SC_ALTCTL_DACT_EN) ;
        SC->ALTCTL |= (SC_ALTCTL_TX_RST | SC_ALTCTL_RX_RST);

}

/**
  * @brief  Turn on and configure the output voltage according the voltage field of structure.
  * @param  dev     The pointer of data structure of smartcard information
  * @return None
  * @note   This is an empty API, implementation is base on hardware design
  */
void SMARTCARD_VoltageConfig(S_SC_DEV_T *dev)
{

        /* select power supply */
        switch(dev->voltage) {
        case SC_ISO_OPERATIONCLASS_A:           /* 5v */
                // TODO: configure VCC to 5V according to hardware design

                break;

        case SC_ISO_OPERATIONCLASS_B:           /* 3v */
                // TODO: configure VCC to 3V according to hardware design

                break;
        default:
        case SC_ISO_OPERATIONCLASS_C:           /* 1.8v */
                // TODO: configure VCC to 1.8V according to hardware design

                break;
        }

}

/**
  * @brief  Determine the active low/high of power pin
  * @param  portno Indicate which port to be used (SC0, SC1, SC2)
  * @param  active 1: active HIGH, 0: active LOW
  * @return None
  */
void SMARTCARD_PowerActiveLevel(SC_TypeDef *portno, int8_t active)
{
#ifdef SC_SEQ_MANUAL
        S_SC_DEV_T *dev;
        int32_t port = 0;

        if(portno==SC0)
                port = 0;
        else if(portno==SC1)
                port = 1;
        else if(portno==SC2)
                port = 2;

        dev = (S_SC_DEV_T *)((uint32_t)&sc_device[port]);

        portno->CTL &= ~SC_CTL_SC_CEN;
        portno->PINCSR &= ~SC_PINCSR_POW_INV;

        portno->CTL |= SC_CTL_SC_CEN;
        if(active==1) {
                portno->PINCSR &= ~SC_PINCSR_POW_EN;    // power pin low in default
                dev->ActivePowerPin = 1;
        } else if(active==0) {
                portno->PINCSR |= SC_PINCSR_POW_EN;     // power pin high in default
                dev->ActivePowerPin = 0;
        }
#else

        portno->CTL &= ~SC_CTL_SC_CEN;
        portno->CTL |= SC_CTL_SC_CEN;
#endif

}


/**
  * @brief  De-activation sequence generator
  * @param  dev The pointer of data structure of smartcard information
  * @return None
  */
void SMARTCARD_DeactivationCmd(S_SC_DEV_T *dev)
{
        SC_TypeDef *SC = dev->base;

#ifdef  SC_SEQ_MANUAL
        // Wait for Tx & Rx get into idle mode
        while(SC->TRSR & SC_TRSR_TX_ATV) ;
        SC->ALTCTL |= SC_ALTCTL_TX_RST;
        while(SC->TRSR & SC_TRSR_RX_ATV) ;
        SC->ALTCTL |= SC_ALTCTL_RX_RST;
        // Reset
        SC->PINCSR &= ~SC_PINCSR_SC_RST;
        while(SC->PINCSR & SC_PINCSR_SC_RST) ;  // wait HW reset pin really becomes LOW
        // Clock
        SC->PINCSR &= ~SC_PINCSR_CLK_KEEP;
        // I/O
        SC->PINCSR &= ~SC_PINCSR_SC_DATA_O;             // output LOW
        while(SC->PINCSR & SC_PINCSR_SC_DATA_O) ;       // wait HW I/O pin really becomes LOW
        // Power
        if(dev->ActivePowerPin)
                SC->PINCSR &= ~SC_PINCSR_POW_EN;
        else
                SC->PINCSR |= SC_PINCSR_POW_EN;
#else
        SC->ALTCTL |= SC_ALTCTL_DACT_EN;
#endif
}
/**
  * @brief  Activation sequence generator
  * @param  dev The pointer of data structure of smartcard information
  * @return None
  */
void SMARTCARD_ActivationCmd(S_SC_DEV_T *dev)
{
        SC_TypeDef *SC = dev->base;

#ifdef  SC_SEQ_MANUAL
        // disable Timer1 interrupt and use polling method to check time-out happened
        SC->IER &= ~SC_IER_TMR1_IE;

        // Power
        if(dev->ActivePowerPin)
                SC->PINCSR |= SC_PINCSR_POW_EN;
        else
                SC->PINCSR &= ~SC_PINCSR_POW_EN;
        // Clock
        SMARTCARD_TimerCountSet(dev, SC_TIMER1, SC_TMR_MODE_DC, 1);
        SMARTCARD_TimerStart(dev, SC_TIMER1);
        while(((SC->ISR & SC_ISR_TMR1_IS) == 0x00) && (dev->errno != SC_ERR_CARD_REMOVED)) ;
        SC->ISR = SC_ISR_TMR1_IS;
        SC->PINCSR |= SC_PINCSR_CLK_KEEP;
        // I/O
        SC->PINCSR |= SC_PINCSR_SC_DATA_O;              // output HIGH
        // Reset
        //SMARTCARD_TimerCountSet(dev, SC_TIMER1, TIMER_DC, 108);       // 108*372 = 40176 clocks
        // [2011.11.24]
        /* EMV Certification: low clock cycles number(39814) from clk high to rst high (cold reset)  */
        SMARTCARD_TimerCountSet(dev, SC_TIMER1, SC_TMR_MODE_DC, 109);   // 108*372 = 40176 clocks
        SMARTCARD_TimerStart(dev, SC_TIMER1);
        while(((SC->ISR & SC_ISR_TMR1_IS) == 0x00) && (dev->errno != SC_ERR_CARD_REMOVED)) ;
        SC->ISR = SC_ISR_TMR1_IS;
        // enable Timer1 interrupt
        SC->IER |= SC_IER_TMR1_IE;
        SC->PINCSR |= SC_PINCSR_SC_RST;
#if 1 	// was out side
        dev->errno = 0;
        dev->op_state = SC_OP_ATR_READ;
#endif
        // wait 42036 clock for ATR
        SMARTCARD_TimerCountSet(dev, SC_TIMER0, SC_TMR_MODE_DC, (42000/372) + 13);
        SMARTCARD_TimerStart(dev, SC_TIMER0);
#else
        SC->ALTCTL |= SC_ALTCTL_ACT_EN;
#endif
}
/**
  * @brief  WarmReset sequence generator
  * @param  dev  The pointer of data structure of smartcard information
  * @return None
  */
void SMARTCARD_WarmResetCmd(S_SC_DEV_T *dev)
{
        SC_TypeDef *SC = dev->base;

#ifdef  SC_SEQ_MANUAL
        int32_t cardno = 0;
        if(dev->base==SC0)
                cardno = 0;
        else if(dev->base==SC1)
                cardno = 1;
        else if(dev->base==SC2)
                cardno = 2;

        // Wait for Tx & Rx get into idle mode
        while((!(SC->TRSR & SC_TRSR_TX_EMPTY_F)) || (SC->TRSR & SC_TRSR_TX_ATV)) ;
        while((!(SC->TRSR & SC_TRSR_RX_EMPTY_F)) || (SC->TRSR & SC_TRSR_RX_ATV)) ;
        // Reset
        while(sc_device[cardno].op_state != SC_OP_NOP) ;                // wait for idle mode
        SC->CTL |= SC_CTL_DIS_RX;                               // disable RX before RST falls
        SC->PINCSR &= ~SC_PINCSR_SC_RST;
        sc_device[cardno].errno = 0;
        SMARTCARD_TimerCountSet(dev, SC_TIMER1, SC_TMR_MODE_DC, (40000/(SC->ETUCR & SC_ETUCR_ETU_RDIV_MASK))+1);     // exceeds 40000 clocks
        SMARTCARD_TimerStart(dev, SC_TIMER1);
        while(sc_device[cardno].errno != SC_ERR_TIME1OUT && sc_device[cardno].errno != SC_ERR_CARD_REMOVED) ;
        SC->PINCSR |= SC_PINCSR_SC_RST;
        SC->CTL &= ~SC_CTL_DIS_RX;                              // enable RX after RST rises
#if 1 	// was out side
        dev->errno = 0;
        dev->op_state = SC_OP_ATR_READ;
#endif
        // wait 42036 clock for ATR
        SMARTCARD_TimerCountSet(dev, SC_TIMER0, SC_TMR_MODE_DC, (42000/372) + 13);
        SMARTCARD_TimerStart(dev, SC_TIMER0);
#else
        SC->ALTCTL |= SC_ALTCTL_WARST_EN;
#endif
}
/**
  * @brief   Set Guard Time
  * @param   dev  The pointer of data structure of smartcard information
  * @return  None
  */
static void SMARTCARD_SetGuardTime(S_SC_DEV_T *dev)
{
        SC_TypeDef *SC = dev->base;
        uint32_t gt = dev->CardCapabilities.GT;

        assert_param( !(gt<11 || gt>267) );

        /* [EMV 2000] EMV in T=0, minmun GT is 12 */
        if(dev->CardCapabilities.Protocol.Selected == SCARD_PROTOCOL_T0) {
                if(gt==11)
                        gt = 12;
                else {
                        SC->CTL &= ~SC_CTL_SLEN;        // 2 EUT stop bit
                        SC->EGTR = (SC->EGTR&~(0xFF)) | (gt-12);
                }
        }

        if(dev->CardCapabilities.Protocol.Selected == SCARD_PROTOCOL_T1) {
                if(gt==11) {
                        SC->CTL |= SC_CTL_SLEN; // 1 EUT stop bit
                        SC->EGTR = (SC->EGTR&~(0xFF));
                } else {
                        SC->CTL |= SC_CTL_SLEN; // 1 EUT stop bit
                        SC->EGTR = (SC->EGTR&~(0xFF)) | (gt-11);
                }
        }
}
/**
  * @brief  Set Block Guard Time
  * @param  dev  The pointer of data structure of smartcard information
  * @param  bgt  Block Guard time (ETU-based)
  * @return None
  */
static void SMARTCARD_SetBlockGuardTime(S_SC_DEV_T *dev, uint32_t bgt)
{
        SC_TypeDef *SC = dev->base;

