xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_smartcard.c
        assert_param( !(bgt<1 || bgt>32) );

        SC->CTL = (SC->CTL & ~SC_CTL_BGT_MASK) | ((bgt - 1) << 8);
}

/**
  * @brief  Enable the checking of block guard time function
  * @param  dev  The pointer of data structure of smartcard information
  * @return None
  */
void SMARTCARD_StartBlockGuardTime( S_SC_DEV_T *dev )
{
        SC_TypeDef *SC = dev->base;
        SC->ALTCTL |= SC_ALTCTL_RX_BGT_EN;
}

/**
  * @brief   Stop the block guard time
  * @param   dev  The pointer of data structure of smartcard information
  * @return  None
  */
void SMARTCARD_StopBlockGuardTime( S_SC_DEV_T *dev )
{
        SC_TypeDef *SC = dev->base;
        SC->ALTCTL &= ~SC_ALTCTL_RX_BGT_EN;
}

/**
  * @brief   Check if Fi and Di is valid
  * @param   fi Fi
  * @param   di Di
  * @return  Parameter is valid or not
  * @retval  SC_STATUS_SUCCESS fi/di is valid
  * @retval  ATR_ERR_INVALID_PARAMETER is not support
  */
static int32_t SMARTCARD_MatchReader(int32_t fi, int32_t di)
{
        int32_t i;

        i = fi/di;

        if( (i % 31) == 0)
                return SC_STATUS_SUCCESS;
        else if( (i % 32) == 0)
                return SC_STATUS_SUCCESS;
        else
                return ATR_ERR_INVALID_PARAMETER;

        // TODO: Maybe do more things here...
        //...
}


/**
  * @brief  Set the baudrate according to clock rate conversion integer and baud rate adjustment integer
  * @param  dev  The pointer of data structure of smartcard information
  * @param  fi   The clock rate conversion integer from card
  * @param  di   The baud rate adjustment integer from card
  * @return None
  */
static void SMARTCARD_SetBaudrate(S_SC_DEV_T *dev, int32_t fi, int32_t di)
{
        uint32_t etudiv;
        /*double*/uint32_t fi_val, di_val,/* tmp, tmp2,*/ remainder;
        SC_TypeDef *SC = dev->base;

        fi_val = ClockRateConversion[fi].F;
        di_val = BitRateAdjustment[di].DNumerator;
        remainder = ((fi_val * 10) / di_val) % 10;
        //tmp = fi_val/di_val;
        //remainder = modf(tmp, &tmp2) * 10;

        // if the first decimal point of etu divider is greater than 5,
        // HW enable the compensation function
        if(remainder >= 5) {
                etudiv = (ClockRateConversion[fi].F / BitRateAdjustment[di].DNumerator);
                SC->ETUCR = SC_ETUCR_COMPEN_EN | etudiv;
        } else {
                etudiv = (ClockRateConversion[fi].F / BitRateAdjustment[di].DNumerator) - 1;
                SC->ETUCR = etudiv;
        }

        if(SC==SC0)
                g_SC0ETUDivider = etudiv;
        else if(SC==SC1)
                g_SC1ETUDivider = etudiv;
        else if(SC==SC2)
                g_SC2ETUDivider = etudiv;

}


/**
  * @brief  According ATR information, basic settings will be set the new value about ETU, clock stop level, guard time and block guard time.
  * @param  dev   The pointer of data structure of smartcard information
  * @return None
  */
void SMARTCARD_SetReaderParameter(S_SC_DEV_T *dev)
{
        /* set reader baud rate and update dev->clock , so we can calcute etu */
        ENTER();

        SMARTCARD_SetBaudrate(dev, dev->CardCapabilities.Fl, dev->CardCapabilities.Dl);

        // TODO: set GT, BGT, clock stop level or apply the new settings

        SMARTCARD_ClockStopLevel( dev );

        SMARTCARD_SetGuardTime( dev );

        if(dev->CardCapabilities.Protocol.Selected == SCARD_PROTOCOL_T0) {
                SMARTCARD_SetBlockGuardTime(dev, 16);   //BGT = 16
        } else if(dev->CardCapabilities.Protocol.Selected == SCARD_PROTOCOL_T1) {
                SMARTCARD_SetBlockGuardTime(dev, 22);   //BGT = 22
                /* set send-sequence & more-data bit */
                dev->T1.SSN = 1;        // default value
                dev->T1.RSN = 0;        // defalut value
                dev->T1.IBLOCK_REC = 0; // default value
        }

        /* Tx & Rx Error Retry Settings */
        /* [EMV 2000] */
        if(dev->CardCapabilities.Protocol.Selected == SCARD_PROTOCOL_T0) {
                SMARTCARD_SetTxRetry(dev, 4);           // Tx retry 4 times
                //SMARTCARD_SetRxRetry(dev, 8);         // Rx retry 8 times
                // [2011.11.25 night]
                /* EMV Certification */
                SMARTCARD_SetRxRetry(dev, 4);           // Rx retry 4 times
        }

        LEAVE();

}


/**
  * @brief  Reset the Tx/Rx FIFO & clock & initail default parameter
  * @param  dev  The pointer of data structure of smartcard information
  * @return None
  */
void SMARTCARD_ResetReader(S_SC_DEV_T *dev)
{
        SC_TypeDef *SC = dev->base;
        IRQn_Type SC_IRQn = (dev->base==SC0)?SC0_IRQn:((dev->base==SC1)?SC1_IRQn:SC2_IRQn);

        ENTER();

        // TODO: Set basic HW settings & protocol default value

        /* Software Reset Tx & Rx transition */
        SMARTCARD_ClearFIFO(dev);

        /* Rx FIFO threshold */
        //SC->CTL = (SC->CTL & ~SC_CTL_RX_FTRI_LEV_MASK) | SC_CTL_RX_FTRI_LEV_3BYTE;      // trigger level 3 bytes
        SC->CTL = (SC->CTL & ~SC_CTL_RX_FTRI_LEV_MASK) | SC_CTL_RX_FTRI_LEV_1BYTE;         // trigger level 1 bytes

        /* Rx Time-out setting */
        SC->RFTMR = 0;          // disable Rx FIFO time-out function

        /* Card detect de-bounce setting */
        SC->CTL &= ~SC_CTL_CD_DEB_SEL_MASK;

        /* in default, guard time = 12 etu */
        dev->CardCapabilities.GT = 12;
        SMARTCARD_SetGuardTime( dev );

        /* initial end sequence timing setting */
        SC->ALTCTL |= SC_ALTCTL_INIT_SEL_MASK;

        /* Tx & Rx Error Retry Settings */
        /* [ISO 7816-3] */
        //SMARTCARD_SetTxRetry(dev, 8);         // Tx retry 8 times
        //SMARTCARD_SetRxRetry(dev, 8);         // Rx retry 8 times

        /*
         * Tx & Rx Error Retry Settings
         * [EMV 2000]
         * EMV 2000 does NOT use ERROR retry function during ATR
         */
        SMARTCARD_SetTxRetry(dev, 0);           // Tx retry 0 times
        SMARTCARD_SetRxRetry(dev, 0);           // Rx retry 0 times

