xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_smartcard.c
        // clear any error status
        // ...

        /* enable auto de-activation sequence */
#ifndef SC_SEQ_MANUAL
        SC->PINCSR |= SC_PINCSR_ADAC_CD_EN;     // auto de-activation when card removal
#endif

        /* enable auto convention */
        SC->CTL |= SC_CTL_AUTO_CON_EN;
        /* enable interrupt  */
        SC->IER |= (SC_IER_RDA_IE |
                SC_IER_TERR_IE |
                SC_IER_TMR0_IE |
                SC_IER_TMR1_IE |
                SC_IER_TMR2_IE |
                SC_IER_BGT_IE |
                SC_IER_CD_IE |
                SC_IER_INIT_IE |
                SC_IER_RTMR_IE |
                SC_IER_ACON_ERR_IE);


        NVIC_DisableIRQ(SC_IRQn);
        dev->errno = 0;
        /* enable SmartCard INT NVIC */
        NVIC_EnableIRQ(SC_IRQn);

        /* in defalut, all timer 24 or 8 or 8 turn on */
        SMARTCARD_TimerSelect(dev, SC_CTL_TMR_SEL_24_8_8_BITS);


        //dev->CardCapabilities.etu = 93;                       // for APDU test card
        //dev->CardCapabilities.GT = 12;                        // for APDU test card
        //dev->CardCapabilities.Protocol.Selected = SCARD_PROTOCOL_RAW; // for APDU test card

        /* Get SC clock */
        if( (CLK->CLKSEL2 & CLK_CLKSEL2_SC_MASK) == CLK_CLKSEL2_SC_HXT )  // form HXT
                dev->clock = (__XTAL/1000);
        //else if( (CLK->CLKSEL2 & CLK_CLKSEL2_SC_MASK) == CLK_CLKSEL2_SC_PLL )     // form PLL... why would anyone use PLL as clk source?
        //        dev->clock = CHECK_PLLOUT_CLK()/1000;
        else if( (CLK->CLKSEL2 & CLK_CLKSEL2_SC_MASK) >= CLK_CLKSEL2_SC_HIRC )    // form HIRC
                dev->clock = __IRC12M/1000;

        if(dev->base==SC0)
                dev->clock /= ((CLK->CLKDIV0 >> 28) + 1);
        else if(dev->base==SC1)
                dev->clock /= ((CLK->CLKDIV1 & CLK_CLKDIV1_SC1_MASK) + 1);
        else
                dev->clock /= ((CLK->CLKDIV1 >> 4) + 1);

        //printf("SC clock      = %d KHz \n", dev->clock);
        //dev->clock = 6000;    // 6 Mhz
        //dev->clock = 4000;    // 4 Mhz
        //dev->clock = 3375;    // 3.375 Mhz
        //dev->clock = 2000;    // 2 Mhz
        dev->CardCapabilities.Fl = 1;
        dev->CardCapabilities.Dl = 1;
        dev->CardCapabilities.N = 0;

        dev->CardCapabilities.T0.WI = 10;

        dev->CardCapabilities.T1.IFSC = 32;
        dev->CardCapabilities.T1.CWI = T1_CWI_DEFAULT;
        dev->CardCapabilities.T1.BWI = T1_BWI_DEFAULT;


        LEAVE();

}


/**
  * @brief   To do the activation sequence and start receiving and parsing ATR information.
  * @param   dev         The pointer of data structure of smartcard information
  * @param   resettype   Type of reset, ex: SC_COLDRESET, SC_WARMRESET
  * @return  The result status of check ATR information
  * @retval  0  Card avtivation success
  * @retval  < 0 Error occured during card activation
  */
static int32_t SMARTCARD_ActivateCard(S_SC_DEV_T *dev, int resettype)
{
        // remain is the remaining ATR length expecting, this value would be update at run time, offset stores distance to the next TD
        //int32_t remain = 2 /* TS & T0 */, offset = -1, tckflag = 0, length = 0;
        //uint8_t *atrbuffer;
        //SC_TypeDef *SC = dev->base;

        ENTER();

        SMARTCARD_ResetReader(dev);

        //SMARTCARD_PowerOn();

        // TODO: set the default ETU clock & Interrupt enable & close all timer
        SMARTCARD_SetBaudrate(dev, 1, 1);        // default 1 ETU == 372 cycles

        memset(&dev->CardCapabilities, 0, sizeof(SCARD_CARD_CAPABILITIES));
        memset(&dev->T0, 0, sizeof(T0_DATA));
        memset(&dev->T1, 0, sizeof(T1_DATA));

        // stop timer0-2
        SMARTCARD_TimerStop(dev, (E_SC_TIMER)(SC_TIMER0 | SC_TIMER1 |SC_TIMER2));


        /* reset the global variable for receiving ATR */
        if(dev->base==SC0) {
                atr_len0=0, atr_remain0=2/* TS & T0 */;
                ifbyte_flag0=-1/* interface bytes flag */, tck0=0, ifcount0=0;
                atr_time0 = ATR_TOTAL_TIME;
                atr_check_time0 = 0;
                atr_final_chk0 = 0;
                atr_total_time_start_flag0 = 0;
        } else if(dev->base==SC1) {
                atr_len1=0, atr_remain1=2/* TS & T0 */;
                ifbyte_flag1=-1/* interface bytes flag */, tck1=0, ifcount1=0;
                atr_time1 = ATR_TOTAL_TIME;
                atr_check_time1 = 0;
                atr_final_chk1 = 0;
                atr_total_time_start_flag1 = 0;
        } else if(dev->base==SC2) {
                atr_len2=0, atr_remain2=2/* TS & T0 */;
                ifbyte_flag2=-1/* interface bytes flag */, tck2=0, ifcount2=0;
                atr_time2 = ATR_TOTAL_TIME;
                atr_check_time2 = 0;
                atr_final_chk2 = 0;
                atr_total_time_start_flag2 = 0;
        }

        /* read ATR */
        dev->CardCapabilities.ATR.Length = 0;

#ifndef SC_SEQ_MANUAL
        // wait for 40000 clks after pull RST high
        /* [ISO 7816-3] */
        //SMARTCARD_TimerCountSet(dev, SC_TIMER0, TIMER_DC_INITIAL_END, (40000/372) + 1);
        //SMARTCARD_TimerStart(dev, SC_TIMER0);
        // wait for 42000 clks after pull RST high
        /* [EMV 2000] */
        SMARTCARD_TimerCountSet(dev, SC_TIMER0, TIMER_DC_INITIAL_END, (42000/372) + 1);
        SMARTCARD_TimerStart(dev, SC_TIMER0);
#endif

        // TODO: Do the activation or warm-reset sequence
        if(resettype == SC_COLDRESET)
                SMARTCARD_ActivationCmd( dev );
        else if(resettype == SC_WARMRESET)
                SMARTCARD_WarmResetCmd( dev );
#if 0	 // move into  SMARTCARD_ActivationCmd() & SMARTCARD_WarmResetCmd(). out them here may be too late
        // start IST to receive ATR
        dev->errno = 0;
        dev->op_state = SC_OP_ATR_READ;
#endif
        // TODO: wait the ISR to receive ATR done.
        while(dev->op_state==SC_OP_ATR_READ ) {
                // [2011.11.28]
                /* EMV Certification */
                if(dev->errno == SC_ERR_TIME2OUT || dev->errno == SC_ERR_TIME0OUT)  // 2012-04-12 Add time0out avoid user insert card in wrong direction  --ya
                        break;
        }
        if(dev->errno < 0) {
                // [2011.11.28]
                /* EMV Certification */
                if(dev->errno == SC_ERR_TIME2OUT ||
                                dev->errno == SC_ERR_TIME0OUT ||
                                (dev->base->PINCSR & SC_PINCSR_CD_PIN_ST) == 0)  // 2012-04-12 Add time0out avoid user insert card in wrong direction  --ya
                        SMARTCARD_DeactivationCmd(dev);
                printf("Failed to read ATR..Error Msg:%s \n", SMARTCARD_ERRMSG(dev->errno));
        } else

#ifdef SC_ATR_DEBUG
        {
                int32_t j;
                printf("ATR : Length : %d\n", dev->CardCapabilities.ATR.Length);
                for( j = 0; j < dev->CardCapabilities.ATR.Length; j ++) {
                        printf("%02x ", dev->CardCapabilities.ATR.Buffer[j]);
                }
                printf("\n");
        }
#endif

        LEAVE();

        return dev->errno;
}


/**
  * @brief  Parse ATR characters and check its integrity
  * @param  dev  The pointer of data structure of smartcard information
  * @param  resettype Indicate reset type. Could be ether SC_COLDRESET or SC_WARMRESET
  * @return The result status of parsing process
  * @retval SC_ERR_UNSUPPORTEDCARD      Card is not supported
  * @retval SC_STATUS_SUCCESS           Success
  * @retval ATR_ERR_UNRECOGNIZED_MEDIA  Invalid to the length of ATR or TS byte or ATR checksum or Fi/Di
  * @retval ATR_ERR_INVALID_PARAMETER   Content of ATR has wrong parameter
  */
static int32_t SMARTCARD_ParseATR(S_SC_DEV_T * dev, int resettype)
{
        int32_t i, retval;
        uint8_t td;
        uint8_t *atr = dev->CardCapabilities.ATR.Buffer;
        uint8_t /*N,*/ T, Fi, Di;
        unsigned long protocolTypes = 0;

