xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_smartcard.c
        struct {
                uint8_t data;
                uint8_t present;
        } ibyte[4][4];

        ENTER();

        memset(&ibyte, 0, sizeof(ibyte));

        atr++;  // skip: TS->T0
        td = *atr++;

        i = 0;

        while(1) {

                /* TAi present */
                if( td & 0x10) {
                        ibyte[i][ATR_INTERFACE_BYTE_TA].data = *atr++;
                        ibyte[i][ATR_INTERFACE_BYTE_TA].present = 1;
                }

                /* TBi present */
                if( td & 0x20) {
                        ibyte[i][ATR_INTERFACE_BYTE_TB].data = *atr++;
                        ibyte[i][ATR_INTERFACE_BYTE_TB].present = 1;
                }

                /* TCi present */
                if( td & 0x40) {
                        ibyte[i][ATR_INTERFACE_BYTE_TC].data = *atr++;
                        ibyte[i][ATR_INTERFACE_BYTE_TC].present = 1;
                }

                /* TDi present */
                if( td & 0x80) {
                        ibyte[i][ATR_INTERFACE_BYTE_TD].data = *atr++;
                        ibyte[i][ATR_INTERFACE_BYTE_TD].present = 1;
                        td = ibyte[i][ATR_INTERFACE_BYTE_TD].data;
                        protocolTypes |= 1 << (td & 0x0F);
                        i++;
                } else
                        break;

        }


#if EMV_ATR_CHECK
        /**********************************************************************************************************************/
        /* Checking the integrity of ATR, this process meets EMV 4.2 specification */
        /* Reject ATR if TA1 is not int the range '11' to '13' */
        if(ibyte[0][ATR_INTERFACE_BYTE_TA].present == 1) {
                if(ibyte[0][ATR_INTERFACE_BYTE_TA].data < 0x11 || ibyte[0][ATR_INTERFACE_BYTE_TA].data > 0x13)
                        return ATR_ERR_INVALID_PARAMETER;
        }

        /* In response to the cold-reset, TB1 only could be 0x00 */
        if(resettype == SC_COLDRESET) {
                if(ibyte[0][ATR_INTERFACE_BYTE_TB].present == 1)
                        if(ibyte[0][ATR_INTERFACE_BYTE_TB].data != 0x00)
                                return ATR_ERR_INVALID_PARAMETER;
                if(ibyte[0][ATR_INTERFACE_BYTE_TB].present == 0)
                        return ATR_ERR_INVALID_PARAMETER;
        }

        /* Reject ATR containing TB2 */
        if(ibyte[1][ATR_INTERFACE_BYTE_TB].present == 1)
                return ATR_ERR_INVALID_PARAMETER;


        /* ATR must contain TB3 in T=1 */
        if(dev->CardCapabilities.Protocol.Selected == SCARD_PROTOCOL_T1) {
                if(ibyte[2][ATR_INTERFACE_BYTE_TB].present == 0)
                        return ATR_ERR_INVALID_PARAMETER;
        }

        /* Bit [5] of TA2 must be equal to 0x0 */
        if(ibyte[1][ATR_INTERFACE_BYTE_TA].present == 1) {
                if((ibyte[1][ATR_INTERFACE_BYTE_TA].data&0x10) == 0x10)
                        return ATR_ERR_INVALID_PARAMETER;
        }

        /* Reject an ATR that TC2 is equal to 0x00 */
        if(ibyte[1][ATR_INTERFACE_BYTE_TC].present == 1 && ibyte[1][ATR_INTERFACE_BYTE_TC].data == 0x00)
                return ATR_ERR_INVALID_PARAMETER;


        /* TD1's l.s. nibble must be 0x0 or 0x1 */
        if(ibyte[0][ATR_INTERFACE_BYTE_TD].present == 1) {
                if((ibyte[0][ATR_INTERFACE_BYTE_TD].data&0xF) > 0x1) {
                        return ATR_ERR_INVALID_PARAMETER;
                }
        }

        /* TD2's l.s. nibble must be 0x1 or 0xE if TD1's l.s. nibble is 0x0 */
        if(ibyte[1][ATR_INTERFACE_BYTE_TD].present == 1) {
                if((ibyte[1][ATR_INTERFACE_BYTE_TD].data&0xF)!=0x1 && (ibyte[1][ATR_INTERFACE_BYTE_TD].data&0xF)!=0xE)
                        return ATR_ERR_INVALID_PARAMETER;

                if((ibyte[1][ATR_INTERFACE_BYTE_TD].data&0xF) == 0xE) {
                        if((ibyte[0][ATR_INTERFACE_BYTE_TD].data&0xF) != 0x0)
                                return ATR_ERR_INVALID_PARAMETER;
                }
        }

        /* Reject TA3 having a value in the range 0x0~0xF or 0xFF */
        if(ibyte[2][ATR_INTERFACE_BYTE_TA].present == 1) {
                if(ibyte[2][ATR_INTERFACE_BYTE_TA].data >= 0x0 &&
                                ibyte[2][ATR_INTERFACE_BYTE_TA].data <= 0xF) {
                        return ATR_ERR_INVALID_PARAMETER;
                }
                if(ibyte[2][ATR_INTERFACE_BYTE_TA].data == 0xFF) {
                        return ATR_ERR_INVALID_PARAMETER;
                }
        }

        /* Reject ATR not containing TB3 or BWI greater than 4 or CWI greater than 5 */
        /* And reject ATR if fitting the formula : 2 to the power of CWI is equal or less than (N+1) */
        if(dev->CardCapabilities.Protocol.Selected == SCARD_PROTOCOL_T1) {
                if(ibyte[2][ATR_INTERFACE_BYTE_TB].present == 1) {
                        if(((ibyte[2][ATR_INTERFACE_BYTE_TB].data&0xF0)>>4) > 0x4)
                                return ATR_ERR_INVALID_PARAMETER;

                        if((ibyte[2][ATR_INTERFACE_BYTE_TB].data&0xF) > 0x5)
                                return ATR_ERR_INVALID_PARAMETER;

                        i = 1;
                        retval = (ibyte[2][ATR_INTERFACE_BYTE_TB].data&0xF);
                        while(retval--)
                                i *= 2;
                        /* if TC1 is equal to 0xFF, N as -1 that is always valid */
                        if(ibyte[0][ATR_INTERFACE_BYTE_TC].data!=0xFF)
                                if( i <= (ibyte[0][ATR_INTERFACE_BYTE_TC].data+1))
                                        return ATR_ERR_INVALID_PARAMETER;

                } else return ATR_ERR_INVALID_PARAMETER;
        }

        /* Reject ATR if TC3 is not equal to 0x00 */
        if(ibyte[2][ATR_INTERFACE_BYTE_TC].present == 1) {
                if(ibyte[2][ATR_INTERFACE_BYTE_TC].data != 0x00) {
                        return ATR_ERR_INVALID_PARAMETER;
                }
        }
        /* End of checking the integrity of ATR */
        /**********************************************************************************************************************/
#endif

        Fi = Di = 1;

