xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_smartcard.c
        /* set Fi and Di if TA1 present */
        if(ibyte[0][ATR_INTERFACE_BYTE_TA].present) {
                Fi = (ibyte[0][ATR_INTERFACE_BYTE_TA].data >> 4) & 0x0f;
                Di = ibyte[0][ATR_INTERFACE_BYTE_TA].data  & 0x0f;
        }

        //N = 0;

        //if(ibyte[0][ATR_INTERFACE_BYTE_TC].present)
        //      N = ibyte[0][ATR_INTERFACE_BYTE_TC].data;

        T = 0;

        /* check TA2 indicates which mode in the card */
        /* in specific mode */
        if(dev->CurrentState == SCARD_SPECIFIC) {
                T = ibyte[1][ATR_INTERFACE_BYTE_TA].data & 0x0f;

                if(ibyte[1][ATR_INTERFACE_BYTE_TA].data & 0x10) { /* Bit5 = 1, using default value */
                        Fi = 1;
                        Di= 1;          /* default value */
                }

                if(SMARTCARD_MatchReader(ClockRateConversion[Fi].F, BitRateAdjustment[Di].DNumerator) == 0) {   /* reader supported mode? */
                        /* do nothing, */
                        /* Match, reader is ready to work */
                        ;
                } else {
                        if(!(ibyte[1][ATR_INTERFACE_BYTE_TA].data & 0x80)) {    /* Bit8 indicate if being capable to change mode */
                                retval = SMARTCARD_WarmReset(dev);      /* change to negotiable mode */
                                if(retval != 0)
                                        return retval;
                                //Fi = 1; Di = 1; T = 0;
                                //retval = SMARTCARD_DoPPS(dev, Fi, Di, T);     /* parameter and protocol select */
                                //if(retval != 0)
                                //      return retval;
                        }
                        //else          // mask for APDU test card
                        //      return SC_ERR_UNSUPPORTEDCARD;
                }

        }

        /* in negotiable mode */
        else if(dev->CurrentState == SCARD_NEGOTIABLE) {
                if (ibyte[0][ATR_INTERFACE_BYTE_TD].present)     // use "first offered transmission protocol"
                        T = ibyte[0][ATR_INTERFACE_BYTE_TD].data & 0x0f;
                else
                        T = 0;          // means protocol T=0

                /* if the values are the default, no PPS should be done */
                if( (Fi==0) && (Di==1) ) {
                        if(SMARTCARD_MatchReader(ClockRateConversion[Fi].F, BitRateAdjustment[Di].DNumerator) == 0) {   /* reader supported mode? */
                                /* do nothing, */
                                /* Match, reader is ready to work */
                                ;
                        } else return SC_ERR_UNSUPPORTEDCARD;
                } else {

                        retval = SMARTCARD_DoPPS(dev, Fi, Di, T);               /* parameter and protocol select */
                        if(retval < 0) {
                                /* PPS failed */
                                printf("DoPPS is failed!!\n");
                                if(retval == SC_ERR_CARD_REMOVED)
                                        return(SC_ERR_CARD_REMOVED);
                        } else {
                                dev->pps_complete = 1;
                                SmartcardUpdateCardCapabilities(dev);
                        }

                }

        }

        SMARTCARD_SetReaderParameter(dev);


        LEAVE();

        return SC_STATUS_SUCCESS;
}

/**
  * @brief   The Cold-reset process that makes activation sequence and gets ATR.
  * @param   dev  The pointer of data structure of smartcard information
  * @return  The result status of check procedure
  * @retval  SC_STATUS_SUCCESS           Success
  * @retval  ATR_ERR_UNRECOGNIZED_MEDIA  Invalid to the length of ATR or TS byte or ATR checksum or Fi/Di
  * @retval  SC_ERR_UNSUPPORTEDCARD      Card is not supported
  * @retval  ATR_ERR_INVALID_PARAMETER   Content of ATR has wrong parameter
  * @retval  ATR_ERR_INVALID_TCK         Checksum of ATR is wrong
  * @retval  SC_ERR_AUTOCONVENTION       TS byte is wrong
  * @retval  SC_ERR_TIME0OUT             Time out
  * @retval  SC_ERR_READ                 Parity error or others during reading ATR
  */
int32_t SMARTCARD_ColdReset(S_SC_DEV_T *dev)
{
        ENTER();

        //SMARTCARD_DeactivationCmd(dev);          // de-activation
        //SMARTCARD_PowerOff(dev);

        SMARTCARD_VoltageConfig(dev);
        dev->errno = SMARTCARD_ActivateCard(dev, SC_COLDRESET);

        if(dev->errno != 0)
                return (dev->errno);

        dev->pps_complete = 0;
        dev->errno = SmartcardUpdateCardCapabilities(dev);

        if(dev->errno != 0)
                return (dev->errno);

        dev->errno = SMARTCARD_ParseATR(dev, SC_COLDRESET);

        if(dev->errno != 0)
                printf("SMARTCARD_ColdReset:: ParseATR..Error Msg:%s \n", SMARTCARD_ERRMSG(dev->errno));

        dev->openflag = 1;

        LEAVE();
        return (dev->errno);
}


/**
  * @brief  The Warm-reset process that makes warm-reset sequence and gets ATR.
  * @param  dev  The pointer of data structure of smartcard information
  * @return The result status of check procedure
  * @retval SC_STATUS_SUCCESS            Success
  * @retval ATR_ERR_UNRECOGNIZED_MEDIA   Invalid to the length of ATR or TS byte or ATR checksum or Fi/Di
  * @retval SC_ERR_UNSUPPORTEDCARD       Card is not supported
  * @retval ATR_ERR_INVALID_PARAMETER    Content of ATR has wrong parameter
  * @retval ATR_ERR_INVALID_TCK          Checksum of ATR is wrong
  * @retval SC_ERR_AUTOCONVENTION        TS byte is wrong
  * @retval SC_ERR_TIME0OUT              Time out
  * @retval SC_ERR_READ                  Parity error or others during reading ATR
  */
int32_t SMARTCARD_WarmReset(S_SC_DEV_T *dev)
{

        ENTER();

        dev->errno = SMARTCARD_ActivateCard(dev, SC_WARMRESET);

        if(dev->errno != 0)
                return (dev->errno);

