xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_smartcard.c
        dev->pps_complete = 0;
        dev->errno = SmartcardUpdateCardCapabilities(dev);

        if(dev->errno != 0)
                return (dev->errno);

        dev->errno = SMARTCARD_ParseATR(dev, SC_WARMRESET);

        if(dev->errno != 0)
                printf("SMARTCARD_WarmReset:: ParseATR..Error Msg:%s \n", SMARTCARD_ERRMSG(dev->errno));

        LEAVE();
        return (dev->errno);

}

/**
  * @brief  The selection of transmission parameters and protocol
  * @param  dev  The pointer of data structure of smartcard information
  * @param  Fi   Clock rate conversion interger from card
  * @param  Di   Baud rate adjustment integer from card
  * @param  T    Transmission protocol
  * @return The result of processes. Status has many situations in writing/reading procedure.
  *
  */
int32_t SMARTCARD_DoPPS(S_SC_DEV_T *dev, int32_t Fi, int32_t Di, int32_t T)
{
        uint8_t buf[4];
        uint8_t *rbuf;
        int32_t len = 4, rPck=0;
        SC_TypeDef *SC = dev->base;

        ENTER();

        buf[0] = 0xff;                                                           /* PPSS: PPS request use 0xFF */
        buf[1] = 0x10 |(T & 0x0f);                                      /* PPS0: PPS1 will be transmited + T transmission protocol */
        buf[2] = ((Fi<<4)&0xf0) | (Di & 0x0f);     /* PPS1: */
        buf[3] = (buf[0] ^ buf[1] ^ buf[2]);            /* PCK */

        SMARTCARD_ClearFIFO(dev);  // clear FIFO

        printf("Sending PPS : %02x %02x %02x %02x\n",
               buf[0], buf[1], buf[2], buf[3]);

        SMARTCARD_TimerStop(dev, (E_SC_TIMER)(SC_TIMER0 | SC_TIMER1 |SC_TIMER2));   // stop timer0-2


        // Waiting time check
        // the waiting time of PPS is fixed at 9600 ETUs
        SMARTCARD_TimerCountSet(dev, SC_TIMER0, SC_TMR_MODE_DC_RELOAD_S_S, 9600);
        SMARTCARD_TimerStart(dev, SC_TIMER0);


        /* Start to do PPS exchange */
        dev->errno = 0;
        dev->snd_buf = buf;
        dev->snd_len = len;
        dev->snd_pos = 0;
        dev->op_state = SC_OP_WRITE;
        SC->IER  |= SC_IER_TBE_IE;
        while(dev->op_state == SC_OP_WRITE && !(dev->errno));
        dev->snd_buf = NULL;

        if(dev->errno != 0) {
                printf("SMARTCARD_DoPPS:: PPS Write..Error Msg:%s \n", SMARTCARD_ERRMSG(dev->errno));
                return dev->errno;
        }

        /* Read Procedure bytes */
        dev->errno = 0;
        rbuf = dev->rcv_buf;
        dev->rcv_pos = 0;
        dev->rcv_len = len;
        dev->rcv_cnt = 0;
        dev->op_state = SC_OP_READ;
        while(dev->op_state == SC_OP_READ && (dev->bCardRemoved == SCARD_PRESENT) && !(dev->errno));

        SMARTCARD_TimerStop(dev, SC_TIMER0);    // Stop timer

        if(dev->errno != 0) {
                printf("SMARTCARD_DoPPS:: PPS Read..Error Msg:%s \n", SMARTCARD_ERRMSG(dev->errno));
                return dev->errno;
        }

        printf("Received PPS : %02x %02x %02x %02x\n",
               rbuf[0], rbuf[1], rbuf[2], rbuf[3]);

        if(rbuf[0] != buf[0])   /* PPSS */
                return PROTOCOL_PPS_INVALID;

        rPck = rbuf[0];
        if( (rbuf[1]&0x0f) == (buf[1] &0x0f) &&         /* success */  /* PPS0 */
                        ((rbuf[1] & 0xf0) == 0x10 ||(rbuf[1] & 0xf0) == 0x00)) {
                rPck ^= rbuf[1];

                printf("PPS Request Success, \n"/*now baudrate is %d\n", 9600 * Dtab[Di]*/);
        } else
                return PROTOCOL_PPS_INVALID;

        if (rbuf[2] == buf[2])  /* PPS1 */
                rPck ^= rbuf[2];
        else
                return PROTOCOL_PPS_INVALID;

        if (rbuf[3] != rPck)  /* PCK */
                return PROTOCOL_PPS_INVALID;


        LEAVE();
        return SC_STATUS_SUCCESS;
}


/**
  * @brief  ATR information, which be read after activation process,
  * @param  portno  Indicate which port to be used (SC0, SC1, SC2)
  * @param  buf     The pointer of received buffer by application
  * @param  length  The data length we needed to read
  * @return The data length of received ATR buffer
  */
int32_t SMARTCARD_GetATRBuffer(SC_TypeDef *portno, uint8_t *buf, int16_t length)
{
        S_SC_DEV_T *dev;
        int32_t port = 0;

        assert_param(CHECK_SC_PORT(portno));

        if(portno==SC0)
                port = 0;
        else if(portno==SC1)
                port = 1;
        else if(portno==SC2)
                port = 2;

        dev =  (S_SC_DEV_T *)((uint32_t)&sc_device[port]);

        if(dev->openflag == 0)
                return(/*SC_EIO*/ 0);    // upper layer could get confused between length and error code, so return 0 instead.

        memcpy(buf, dev->CardCapabilities.ATR.Buffer,
               (length<dev->CardCapabilities.ATR.Length)?length:dev->CardCapabilities.ATR.Length);

        return dev->CardCapabilities.ATR.Length;
}


/**
  * @brief   Transmit the packet according to protocol T=0 or T=1
  * @param   portno     Indicate which port to be used (SC0, SC1, SC2)
  * @param   buf        The pointer of transmitted buffer
  * @param   len        The length of transmitted buffer
  * @param   outbuf     The pointer of received buffer
  * @param   outlen     The length of received data
  * @return  The result of processes. Status has many situations in writing/reading procedure.
  * @retval  SC_STATUS_SUCCESS Success
  * @retval  SC_EBUSY Smart card interface is doing something
  * @retval  SC_EIO Card removed or unsupported card
  * @retval  Other The error code of transmission and receiver.
  */
int32_t SMARTCARD_Write(SC_TypeDef *portno, uint8_t *buf, uint32_t len, uint8_t *outbuf, uint32_t *outlen )
{
        S_SC_DEV_T *dev;
        int32_t ret = SC_STATUS_SUCCESS, port = 0;

        ENTER();

        assert_param(CHECK_SC_PORT(portno));
        assert_param( len!=0 );

        if(portno==SC0)
                port = 0;
        else if(portno==SC1)
                port = 1;
        else if(portno==SC2)
                port = 2;

        dev =  (S_SC_DEV_T *)((uint32_t)&sc_device[port]);

        if(dev->op_state)       // card busy
                return SC_EBUSY;

        if(SMARTCARD_CheckCardPresent(portno) != SCARD_PRESENT)
                return SC_EIO;

        if(dev->openflag == 0)
                return(SC_EIO);

