xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_smartcard.c
        if(len > MAX_BUF_LEN)
                len = MAX_BUF_LEN;

        // Call write means we give up data remain in dev->buf
        dev->snd_pos = 0;
        dev->rcv_pos = 0;

        if(portno == SC0)
                memset(&g_Port0_RxBUF[0], 0x00, sizeof(g_Port0_RxBUF));
        else if(portno == SC1)
                memset(&g_Port1_RxBUF[0], 0x00, sizeof(g_Port1_RxBUF));
        else if(portno == SC2)
                memset(&g_Port2_RxBUF[0], 0x00, sizeof(g_Port2_RxBUF));

        //      dispatch on the selected protocol
        switch( dev->CardCapabilities.Protocol.Selected ) {
        case SCARD_PROTOCOL_T0:
                ret = CBT0Transmit( dev, buf, len, outbuf, outlen );
                break;

        case SCARD_PROTOCOL_T1:
                if(portno == SC0) {
                        memset(g_Port0_TxBUF, 0x00, sizeof(g_Port0_TxBUF));
                        dev->snd_buf = &g_Port0_TxBUF[0];
                        dev->rcv_buf = &g_Port0_RxBUF[0];
                } else if(portno == SC1) {
                        memset(g_Port1_TxBUF, 0x00, sizeof(g_Port1_TxBUF));
                        dev->snd_buf = &g_Port1_TxBUF[0];
                        dev->rcv_buf = &g_Port1_RxBUF[0];
                } else if(portno == SC2) {
                        memset(g_Port2_TxBUF, 0x00, sizeof(g_Port2_TxBUF));
                        dev->snd_buf = &g_Port2_TxBUF[0];
                        dev->rcv_buf = &g_Port2_RxBUF[0];
                }

                ret = CBT1Transmit( dev, buf, len, outbuf, outlen );
                break;

        case SCARD_PROTOCOL_RAW:
                //ret = CBRawTransmit( dev, buf, len, len, outbuf, outlen);
                break;

        default:
                ret = SC_EPROTOCOL;
                break;
        }

        if(ret != SC_STATUS_SUCCESS) {
                /* stop all */
                SMARTCARD_StopBlockGuardTime( dev );            // stop block guard time
                SMARTCARD_TimerStop(dev, (E_SC_TIMER)(SC_TIMER0 | SC_TIMER1 |SC_TIMER2));   // stop timer0-2
                printf("Failed to Transfer T=0..Error Msg:%s \n", SMARTCARD_ERRMSG(ret));
        }

        LEAVE();

        return ret;

}


/**
  * @brief  This function could activate the smartcard device and use the appropriate the voltage.
  *         If any procedure is failed, do de-activation to end the process.
  * @param  portno  Indicate which port to be used (SC0, SC1, SC2)
  * @return Success or not
  * @retval SC_STATUS_SUCCESS           Successful
  * @retval SC_EBUSY                    Interface already opened
  * @retval SC_EIO                      Card removed or unsupported card
  * @retval ATR_ERR_INVALID_PARAMETER   Content of ATR has wrong parameter
  * @retval ATR_ERR_INVALID_TCK         Checksum of ATR is wrong
  * @retval SC_ERR_AUTOCONVENTION       TS byte is wrong
  * @retval SC_ERR_TIME0OUT             Time out
  * @retval SC_ERR_READ                 Parity error or others during reading ATR
  */
int32_t SMARTCARD_Open(SC_TypeDef *portno)
{
        int32_t retval = SC_STATUS_SUCCESS, i, port = 0;
        S_SC_DEV_T *dev;
        SC_TypeDef *SC;
        //IRQn_Type SC_IRQn;

        ENTER();

        assert_param(CHECK_SC_PORT(portno));

        if(portno==SC0)
                port = 0;
        else if(portno==SC1)
                port = 1;
        else if(portno==SC2)
                port = 2;

        dev = (S_SC_DEV_T *)((uint32_t)&sc_device[port]);

        if( dev->openflag != 0 )                /* a card slot can open only once */
                return(SC_EBUSY);

        dev->base = portno;

        SC = portno;
        //SC_IRQn = (portno==0)?SC0_IRQn:SC0_IRQn;

        SMARTCARD_ResetReader(dev);             // initiate some parameters

        /* point to receive buffer */
        if(portno == SC0) {
                dev->rcv_buf = (uint8_t *)&g_Port0_RxBUF;//(uint8_t *)malloc(MAX_BUF_LEN * sizeof(uint8_t));
                dev->snd_buf = (uint8_t *)&g_Port0_TxBUF;
        } else if(portno == SC1) {
                dev->rcv_buf = (uint8_t *)&g_Port1_RxBUF;//(uint8_t *)malloc(MAX_BUF_LEN * sizeof(uint8_t));
                dev->snd_buf = (uint8_t *)&g_Port1_TxBUF;
        } else if(portno == SC2) {
                dev->rcv_buf = (uint8_t *)&g_Port2_RxBUF;//(uint8_t *)malloc(MAX_BUF_LEN * sizeof(uint8_t));
                dev->snd_buf = (uint8_t *)&g_Port2_TxBUF;
        }

        if((dev->bCardRemoved==SCARD_ABSENT) || (dev->bCardRemoved==SCARD_UNKNOWN)) {
                printf("Card missing\n");
                retval = SC_EIO;
                goto _exit_open;
        } else {
                /* default: 1.8V start */
                dev->voltage = SC_ISO_OPERATIONCLASS_C;

                for( i = 0; i < 1/*3*/; i++) {
                        if((retval = SMARTCARD_ColdReset(dev)) != 0) {
                                if(i==1)
                                        dev->voltage = SC_ISO_OPERATIONCLASS_B;  // 1.8V failed, use 3V
                                if(i==2)
                                        dev->voltage = SC_ISO_OPERATIONCLASS_A;  // 3V failed, use 5V
                                continue;
                        }
                        break;
                }

                if(retval != 0) {
                        // TODO: disable Group mask
                        printf("Cold-Reset is failed...\n");
                        SC->IER = SC_IER_CD_IE;         // Keep the card detection interrupt. Modified by SM

                }
        }

_exit_open:
        dev->openflag = 1;
        dev->errno = 0;  // clear error code happened during cold reset

        printf("Open Done\n");

        LEAVE();

        return retval;

}


/**
  * @brief  Disable interrupt and do de-activation
  * @param  portno  Indicate which port to be used (SC0, SC1, SC2)
  * @return This function always return success
  * @retval SC_STATUS_SUCCESS  Success
  */
int32_t SMARTCARD_Close(SC_TypeDef *portno)
{
        S_SC_DEV_T *dev;
        IRQn_Type SC_IRQn;
        SC_TypeDef *SC;
        int32_t port = 0;

        ENTER();

