xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_smartcard.c
        assert_param(CHECK_SC_PORT(portno));

        SC_IRQn = (portno==SC0)?SC0_IRQn:((portno==SC1)?SC1_IRQn:SC2_IRQn);

        SC = portno;
        if(portno==SC0)
                port = 0;
        else if(portno==SC1)
                port = 1;
        else if(portno==SC2)
                port = 2;

        dev = (S_SC_DEV_T *)((uint32_t)&sc_device[port]);
        //if(dev->openflag == 0)
        //      return(SC_EIO);

        // TODO: disable group mask

        /* Disable NVIC SmartCard interrupt */
        NVIC_DisableIRQ(SC_IRQn);

        SMARTCARD_DeactivationCmd( dev );          // de-activation
        //SMARTCARD_PowerOff();

        SC->IER = 0;            // disable all interrupt

        //free(dev->rcv_buf);

        dev->openflag = 0;

        LEAVE();

        return SC_STATUS_SUCCESS;
}



/**
  * @brief   nitialization process configures smartcard port and enables its clock and engine clock
  * @param   portno  Indicate which port to be used (SC0, SC1, SC2)
  * @param   edge    Indicate card detect polatiry. 1 means rising edge, 0 means falling edge.
  * @return  None
  */
void SMARTCARD_Init(SC_TypeDef *portno, int8_t edge)
{
        S_SC_DEV_T *dev;
        SC_TypeDef *SC;
        IRQn_Type SC_IRQn;
        int32_t port = 0;

        assert_param(CHECK_SC_PORT(portno));

        SC = portno;
        SC_IRQn = (portno==SC0)?SC0_IRQn:((portno==SC1)?SC1_IRQn:SC2_IRQn);

        if(portno==SC0)
                port = 0;
        else if(portno==SC1)
                port = 1;
        else if(portno==SC2)
                port = 2;


        dev = (S_SC_DEV_T *)((uint32_t)&sc_device[port]);
        memset(dev, 0, sizeof(S_SC_DEV_T));
        dev->base = portno;     //ya

        if(portno==SC0)
                CLK->APBCLK |= CLK_APBCLK_SC0_EN;
        else if(portno==SC1)
                CLK->APBCLK |= CLK_APBCLK_SC1_EN;
        else if(portno==SC2)
                CLK->APBCLK |= CLK_APBCLK_SC2_EN;

        /* Card is Absent in default */
        dev->bCardRemoved = SCARD_ABSENT;

        if(edge)
                portno->PINCSR |= SC_PINCSR_CD_LEV;             // this must be set before enable engine
        else
                portno->PINCSR &= ~SC_PINCSR_CD_LEV;

        // enable smartcard engine
        SC->CTL |= SC_CTL_SC_CEN;

        /* enable SmartCard INT NVIC */
        NVIC_EnableIRQ(SC_IRQn);

        // enable card detection interrupt
        SC->IER |= SC_IER_CD_IE;

        printf("\n[%s] : SC%d Init...\n", __func__, port);


}

/**
  * @brief   DeInitialization a smartcard interface
  * @param   portno  Indicate which port to be DeInit (SC0, SC1, SC2)
  * @return  None
  */
void SMARTCARD_DeInit(SC_TypeDef *portno)
{
        IRQn_Type SC_IRQn = (portno == SC0) ? SC0_IRQn : ((portno == SC1) ? SC1_IRQn : SC2_IRQn);
        if(portno==SC0)
                CLK->APBCLK &= ~CLK_APBCLK_SC0_EN;
        else if(portno==SC1)
                CLK->APBCLK &= ~CLK_APBCLK_SC1_EN;
        else if(portno==SC2)
                CLK->APBCLK &= ~CLK_APBCLK_SC2_EN;

        NVIC_DisableIRQ(SC_IRQn);
}

/**
  * @brief  Enable Timer Interrupt
  * @param  dev  The pointer of data structure of smartcard information
  * @param  no   Timer number. (SC_TIMER0, SC_TIMER1, SC_TIMER2)
  * @return None
  */
void SMARTCARD_TimerINTEnable(S_SC_DEV_T *dev, E_SC_TIMER no)
{
        SC_TypeDef *SC = dev->base;
        if( no & SC_TIMER0) SC->IER |= SC_IER_TMR0_IE;
        if( no & SC_TIMER1) SC->IER |= SC_IER_TMR1_IE;
        if( no & SC_TIMER2) SC->IER |= SC_IER_TMR2_IE;
}

/**
  * @brief   Disable Timer Interrupt
  * @param   dev     The pointer of data structure of smartcard information
  * @param   no      Tmer number. (SC_TIMER0, SC_TIMER1, SC_TIMER2)
  * @return  None
  */
void SMARTCARD_TimerINTDisable(S_SC_DEV_T *dev, E_SC_TIMER no)
{
        SC_TypeDef *SC = dev->base;
        if( no & SC_TIMER0) SC->IER &= ~SC_IER_TMR0_IE;
        if( no & SC_TIMER1) SC->IER &= ~SC_IER_TMR1_IE;
        if( no & SC_TIMER2) SC->IER &= ~SC_IER_TMR2_IE;
}

/**
  * @brief  Select which type of versatile timer, 24-bit, 24-8-bit or 24-8-8-bit
  * @param  dev     The pointer of data structure of smartcard information
  * @param  type    Could be SC_TMR_24_Bit, SC_TMR_24_8_Bit, SC_TMR_24_8_8_Bit
  * @return None
  */
void SMARTCARD_TimerSelect(S_SC_DEV_T *dev, uint32_t type)
{
        SC_TypeDef *SC = dev->base;
        SC->CTL = (SC->CTL & ~SC_CTL_TMR_SEL_MASK) | type;
}

/**
  * @brief  Enable Timer starting, counter will count when condition match
  * @param  dev   The pointer of data structure of smartcard information
  * @param  no    Timer number. (SC_TIMER0, SC_TIMER1, SC_TIMER2)
  * @return None
  */
void SMARTCARD_TimerStart(S_SC_DEV_T *dev, E_SC_TIMER no)
{
        SC_TypeDef *SC = dev->base;
        if(no & SC_TIMER0) {
                SC->ISR = SC_ISR_TMR0_IS;
                SC->ALTCTL |= SC_ALTCTL_TMR0_SEN;
        }
        if(no & SC_TIMER1) {
                SC->ISR = SC_ISR_TMR1_IS;
                SC->ALTCTL |= SC_ALTCTL_TMR1_SEN;
        }
        if(no & SC_TIMER2) {
                SC->ISR = SC_ISR_TMR2_IS;
                SC->ALTCTL |= SC_ALTCTL_TMR2_SEN;
        }
}

/**
  * @brief  Stop Timer counting
  * @param  dev   The pointer of data structure of smartcard information
  * @param  no    Timer number. (SC_TIMER0, SC_TIMER1, SC_TIMER2)
  * @return None
  */
void SMARTCARD_TimerStop(S_SC_DEV_T *dev, E_SC_TIMER no)
{
        SC_TypeDef *SC = dev->base;
        if(no & SC_TIMER0)
                SC->ALTCTL &= ~SC_ALTCTL_TMR0_SEN;
        if(no & SC_TIMER1)
                SC->ALTCTL &= ~SC_ALTCTL_TMR1_SEN;
        if(no & SC_TIMER2)
                SC->ALTCTL &= ~SC_ALTCTL_TMR2_SEN;
}

/**
  * @brief  Stop All Timer counting
  * @param  dev    The pointer of data structure of smartcard information
  * @return None
  */
void SMARTCARD_TimerAllStop( S_SC_DEV_T *dev )
{
        SC_TypeDef *SC = dev->base;
        // disable all internal timer function

        SC->ALTCTL &= ~(SC_ALTCTL_TMR0_SEN | SC_ALTCTL_TMR1_SEN | SC_ALTCTL_TMR2_SEN);

