xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_smartcard.c
}

/**
  * @brief  Specified Timer uses specified operation mode and set ETU number to count.
  * @param  dev      The pointer of data structure of smartcard information
  * @param  no       Timer number. (SC_TIMER0, SC_TIMER1, SC_TIMER2)
  * @param  op_mode  Timer operating mode
  * @param  cnt      Amount count (ETU-based)
  * @return None
  */
void SMARTCARD_TimerCountSet(S_SC_DEV_T *dev, E_SC_TIMER no, uint32_t op_mode, uint32_t cnt)
{
        SC_TypeDef *SC = dev->base;
        uint32_t reg = op_mode | (0xFFFFFF & (cnt-1));

        if(no == SC_TIMER0) {
                SC->TMR0 = reg;
        } else if(no == SC_TIMER1) {
                SC->TMR1 = reg;
        } else if(no == SC_TIMER2) {
                SC->TMR2 = reg;
        }
}


/**
  * @brief  In receiving mode and just waiting for data in, this function uses to detect the first data byte if time-out
  * @param  dev     The pointer of data structure of smartcard information
  * @param  no      Timer number. (SC_TIMER0, SC_TIMER1, SC_TIMER2)
  * @param  op_mode E_SC_TIMER_OPMODE
  * @param  cnt     Amount count (ETU-based)
  * @return None
  */
void SMARTCARD_WaitFirstReceivedData(S_SC_DEV_T *dev, E_SC_TIMER no, uint32_t op_mode, uint32_t cnt)
{
        int32_t timeOutCount = 0, remainderCount = 0;
        int32_t errorflag = 0;

        /* Because TIMER1 or TIMER2 Max. ETU count is 256 */
        if(no != SC_TIMER0) {
                timeOutCount = cnt / 256;
                remainderCount = cnt % 256;
        }

        if(no == SC_TIMER0)
                errorflag = SC_ERR_TIME0OUT;
        else if(no == SC_TIMER1)
                errorflag = SC_ERR_TIME1OUT;
        else if(no == SC_TIMER2)
                errorflag = SC_ERR_TIME2OUT;

        while(timeOutCount) {
                dev->errno = 0;
                SMARTCARD_TimerCountSet(dev, no, op_mode, 256);
                SMARTCARD_TimerStart(dev, no);

                while( !(dev->errno) ) {
                        if(dev->errno == errorflag)
                                break;
                        else {
                                // if received the first data ?
                                if(dev->rcv_cnt > 0) {
                                        SMARTCARD_TimerStop(dev, no);
                                        return ;
                                }

                                // if had any other errors ?
                                if( (dev->errno!=errorflag) && (dev->errno!=0))
                                        return ;
                        }
                }
                timeOutCount--;
        }

        if(remainderCount) {
                dev->errno = 0;
                SMARTCARD_TimerCountSet(dev, no, op_mode, remainderCount);
                SMARTCARD_TimerStart(dev, no);

                while( !(dev->errno) ) {
                        if(dev->errno == errorflag)
                                break;
                        else {
                                // if received the first data ?
                                if(dev->rcv_cnt > 0) {
                                        SMARTCARD_TimerStop(dev, no);
                                        return ;
                                }

                                // if had any other errors ?
                                if( (dev->errno!=errorflag) && (dev->errno!=0))
                                        return ;
                        }
                }
        }
        /* really time-out happened on first byte */
        dev->op_state = SC_OP_NOP;
        dev->errno = errorflag;

}

/**
  * @brief  Enable smartcard uart interface
  * @param  portno   The pointer of smartcard interface
  * @param  sParam   Configuration parameter
  * @return None
  */
void SMARTCARD_UartOpen(SC_TypeDef *portno, S_SC_UART *sParam)
{
	S_SC_DEV_T *dev;
	int32_t port = 0, div;
		
	assert_param(CHECK_SC_PORT(portno));
	assert_param(sParam != NULL);
	assert_param(sParam->u16TimeOut < 0x200);
	assert_param((sParam->u32CharLen & ~SC_UACTL_DATA_LEN_MASK) == 0);
	assert_param((sParam->u32StopBitLen & ~SC_CTL_SLEN) == 0);
	assert_param((sParam->u32Parity & ~(SC_UACTL_PBDIS | SC_UACTL_OPE)) == 0);
	assert_param((sParam->u32RxTriggerLevel & ~SC_CTL_RX_FTRI_LEV_MASK) == 0);

	if(portno==SC0)
		port = 0;
	else if(portno==SC1)
		port = 1;
	else
		port = 2;
	
	dev= (S_SC_DEV_T *)(uint32_t)&sc_device[port];	
	dev->uart = 1;

        /* Get SC clock */
        if( (CLK->CLKSEL2 & CLK_CLKSEL2_SC_MASK) == CLK_CLKSEL2_SC_HXT )  // form HXT
                dev->clock = __XTAL;
        else if( (CLK->CLKSEL2 & CLK_CLKSEL2_SC_MASK) >= CLK_CLKSEL2_SC_HIRC )    // form HIRC
                dev->clock = __IRC12M;

        if(dev->base==SC0)
                dev->clock /= ((CLK->CLKDIV0 >> 28) + 1);
        else if(dev->base==SC1)
                dev->clock /= ((CLK->CLKDIV1 & CLK_CLKDIV1_SC1_MASK) + 1);
        else
                dev->clock /= ((CLK->CLKDIV1 >> 4) + 1);

	div = dev->clock / sParam->u32BaudRate - 1;
	if((dev->clock % sParam->u32BaudRate) > (sParam->u32BaudRate / 2))
		div++;
	portno->ETUCR = div;
	portno->RFTMR = sParam->u16TimeOut;
	portno->CTL = (portno->CTL & ~(SC_CTL_RX_FTRI_LEV_MASK | SC_CTL_SLEN)) | sParam->u32StopBitLen | sParam->u32RxTriggerLevel;	
	portno->UACTL = sParam->u32Parity | sParam->u32CharLen | SC_UACTL_UA_MODE_EN;
	
	portno->ALTCTL = 3;		// reset FIFO. what ever inside is garbage before configuration finished.

	return;
}

/**
  * @brief  Disable smartcard uart interface
  * @param  portno   The pointer of smartcard interface
  * @return None
  */
void SMARTCARD_UartClose(SC_TypeDef *portno)
{
	S_SC_DEV_T *dev;
	int32_t port = 0;
		
	assert_param(CHECK_SC_PORT(portno));
	SMARTCARD_UartDisableInt(portno);

	if(portno==SC0)
		port = 0;
	else if(portno==SC1)
		port = 1;
	else if(portno==SC2)
		port = 2;
	
	dev= (S_SC_DEV_T *)(uint32_t)&sc_device[port];	
	dev->uart = 0;
	portno->UACTL = 0;	
	
	return;
}

/**
  * @brief  Read data from Sc UART interface
  * @param  portno The pointer of smartcard interface
  * @param  pu8RxBuf Pointer to buffers to store receive data
  * @param  u32ReadBytes Available buffer length to store data
  * @return Number of bytes received
  */
int32_t SMARTCARD_UartRead(SC_TypeDef *portno, uint8_t *pu8RxBuf, uint32_t u32ReadBytes)
{

    uint32_t  u32Count, u32delayno;

