xhawk18/TinyThread/trunk/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_smartcard.c
	assert_param(CHECK_SC_PORT(portno));
	assert_param(pu8RxBuf != NULL);

	for (u32Count=0; u32Count < u32ReadBytes; u32Count++)
	{
		u32delayno = 0;
		while (portno->TRSR & SC_TRSR_RX_EMPTY_F) /* Check RX empty => failed */	
		{
			u32delayno++;
			if ( u32delayno >= 0x40000000 )
				goto out;
		}
		pu8RxBuf[u32Count] = portno->RBR;					    /* Get Data from UART RX  */
	}

out:
	return(u32Count);
}

/**
  * @brief  Write data to Sc UART interface
  * @param  portno The pointer of smartcard interface
  * @param  pu8TxBuf Pointer to buffers to send
  * @param  u32WriteBytes Number of bytes to send
  * @return Number of bytes sent
  */
int32_t SMARTCARD_UartWrite(SC_TypeDef *portno, uint8_t *pu8TxBuf, uint32_t u32WriteBytes)
{

    uint32_t  u32Count, u32delayno;

	assert_param(CHECK_SC_PORT(portno));
	assert_param(pu8TxBuf != NULL);

	for (u32Count=0; u32Count < u32WriteBytes; u32Count++)
	{
		u32delayno = 0;
		while (portno->TRSR & SC_TRSR_TX_FULL_F)  /* Wait Tx empty and Time-out manner */
		{
			u32delayno++;
			if ( u32delayno >= 0x40000000 )     	
				goto out;     	
				
		}
		portno->THR = pu8TxBuf[u32Count]; /* Send UART Data from buffer */
	}

out:
	return(u32Count);

}

/**
  * @brief  Enable SC UART interrupt
  * @param  portno   The pointer of smartcard interface
  * @return None
  */
void SMARTCARD_UartEnableInt(SC_TypeDef *portno)
{
	IRQn_Type SC_IRQn = (portno==SC0)?SC0_IRQn:((portno==SC1)?SC1_IRQn:SC2_IRQn);

	portno->IER = 0x203;	// Enable tx, rx, and rx timeout
	NVIC_EnableIRQ(SC_IRQn);
}

/**
  * @brief  Disable SC UART interrupt
  * @param  portno   The pointer of smartcard interface
  * @return None
  */
void SMARTCARD_UartDisableInt(SC_TypeDef *portno)
{
	IRQn_Type SC_IRQn = (portno==SC0)?SC0_IRQn:((portno==SC1)?SC1_IRQn:SC2_IRQn);

	portno->IER = 0;
	NVIC_DisableIRQ(SC_IRQn);
}

/*@}*/ /* end of group NANO1xx_SMARTCARD_EXPORTED_FUNCTIONS */


/*@}*/ /* end of group NANO1xx_SMARTCARD_Driver */

/*@}*/ /* end of group NANO1xx_Device_Driver */

/*** (C) COPYRIGHT 2012 Nuvoton Technology Corp. ***/



